shreym01/SE423_repo/C2000Ware_4_01_00_00/device_support/f2837xd/examples/cpu1/AstarProjectwithCANStarter/cpu01/AstarProjectwithCANStarter_main.c
            if (LADARfront < 1.2) {
                vref = 0.2;
                checkfronttally++;
                if (checkfronttally > 310) { // check if LADARfront < 1.2 for 310ms or 3 LADAR samples
                    RobotState = 10; // Wall follow
                    WallFollowtime = 0;
                    right_wall_follow_state = 1;
                }
            } else {
                checkfronttally = 0;
            }

            break;
        case 10:
            if (right_wall_follow_state == 1) {
                //Left Turn
                turn = Kp_front_wall*(14.5 - LADARfront);
                vref = front_turn_velocity;
                if (LADARfront > left_turn_Stop_threshold) {
                    right_wall_follow_state = 2;
                }
            } else if (right_wall_follow_state == 2) {
                //Right Wall Follow
                turn = Kp_right_wal*(ref_right_wall - LADARrightfront);
                vref = foward_velocity;
                if (LADARfront < left_turn_Start_threshold) {
                    right_wall_follow_state = 1;
                }
            }
            if (turn > turn_saturation) {
                turn = turn_saturation;
            }
            if (turn < -turn_saturation) {
                turn = -turn_saturation;
            }

            WallFollowtime++;
            if ( (WallFollowtime > 5000) && (LADARfront > 1.5) ) {
                RobotState = 1;
                checkfronttally = 0;
            }
            break;

        case 20:
            // put vision code here
            break;
        default:
            break;
        }
        if (AstarRunning == 1) {  // pause the robot while Astar is running on the PI4.  Once new path sent from PI AstarRunning will be set to 0
            vref = 0;
            turn = 0;
        }

        //Must be called each time into this SWI1 function
        PIcontrol(&uLeft,&uRight,vref,turn,LeftWheel,RightWheel);
        // These below lines also must be called each time into this SWI1 function
        setEPWM1A(uLeft);
        setEPWM2A(-uRight);
        setF28027EPWM1A(uLeft);
        setF28027EPWM2A(-uRight);
        LeftWheel_1 = LeftWheel;
        RightWheel_1 = RightWheel;

        if((timecount%250) == 0) {
            DataToLabView.floatData[0] = ROBOTps.x;
            DataToLabView.floatData[1] = ROBOTps.y;
            DataToLabView.floatData[2] = ROBOTps.theta;
            DataToLabView.floatData[3] = (float)timecount;
            DataToLabView.floatData[4] = 0.5*(LeftVel + RightVel);
            DataToLabView.floatData[5] = (float)RobotState;
            DataToLabView.floatData[6] = (float)statePos;
            DataToLabView.floatData[7] = LADARfront;
            LVsenddata[0] = '*';  // header for LVdata
            LVsenddata[1] = '$';
            for (i=0;i<LVNUM_TOFROM_FLOATS*4;i++) {
                if (i%2==0) {
                    LVsenddata[i+2] = DataToLabView.rawData[i/2] & 0xFF;
                } else {
                    LVsenddata[i+2] = (DataToLabView.rawData[i/2]>>8) & 0xFF;
                }
            }
            serial_sendSCID(&SerialD, LVsenddata, 4*LVNUM_TOFROM_FLOATS + 2);
        }
        if (StartAstar == 1) {
            StartAstar = 0;
            AstarRunning = 1;
            SendAStarInfo.cur_obs.x = ROBOTps.x;
            SendAStarInfo.cur_obs.y = ROBOTps.y;

            // Right now fixed to one point in the course get ride of temp_y and temp_x
            int16_t temp_y = 8;
            int16_t temp_x = 3;
            SendAStarInfo.cur_obs.destrow = 11 - temp_y;
            SendAStarInfo.cur_obs.destcol = temp_x + 5;

            int16_t currentByte = 0;
            for (i=0; i<176; i++) {
                SendAStarInfo.cur_obs.mapCondensed[currentByte] = 0;
                if (map[i] == 'x') {
                    SendAStarInfo.cur_obs.mapCondensed[currentByte] |= 0x1;
                }
                i++;
                if (map[i] == 'x') {
                    SendAStarInfo.cur_obs.mapCondensed[currentByte] |= 0x2;
                }
                i++;
                if (map[i] == 'x') {
                    SendAStarInfo.cur_obs.mapCondensed[currentByte] |= 0x4;
                }
                i++;
                if (map[i] == 'x') {
                    SendAStarInfo.cur_obs.mapCondensed[currentByte] |= 0x8;
                }
                i++;
                if (map[i] == 'x') {
                    SendAStarInfo.cur_obs.mapCondensed[currentByte] |= 0x10;
                }
                i++;
                if (map[i] == 'x') {
                    SendAStarInfo.cur_obs.mapCondensed[currentByte] |= 0x20;
                }
                i++;
                if (map[i] == 'x') {
                    SendAStarInfo.cur_obs.mapCondensed[currentByte] |= 0x40;
                }
                i++;
                if (map[i] == 'x') {
                    SendAStarInfo.cur_obs.mapCondensed[currentByte] |= 0x80;
                }
                currentByte++;
            }
            SendAStarRawData[0] = '*';
            SendAStarRawData[1] = '*';
            SendAStarRawData[2] = SendAStarInfo.obs_data_char[0]&0xFF;
            SendAStarRawData[3] = (SendAStarInfo.obs_data_char[0]>>8)&0xFF;
            SendAStarRawData[4] = SendAStarInfo.obs_data_char[1]&0xFF;
            SendAStarRawData[5] = (SendAStarInfo.obs_data_char[1]>>8)&0xFF;
            SendAStarRawData[6] = SendAStarInfo.obs_data_char[2]&0xFF;
            SendAStarRawData[7] = (SendAStarInfo.obs_data_char[2]>>8)&0xFF;
            SendAStarRawData[8] = SendAStarInfo.obs_data_char[3]&0xFF;
            SendAStarRawData[9] = (SendAStarInfo.obs_data_char[3]>>8)&0xFF;
            SendAStarRawData[10] = SendAStarInfo.obs_data_char[4]&0xFF;
            SendAStarRawData[11] = (SendAStarInfo.obs_data_char[4]>>8)&0xFF;
            SendAStarRawData[12] = SendAStarInfo.obs_data_char[5]&0xFF;
            SendAStarRawData[13] = (SendAStarInfo.obs_data_char[5]>>8)&0xFF;
            for (i=0;i<22;i++) {
                SendAStarRawData[i+14]=SendAStarInfo.cur_obs.mapCondensed[i];
            }
            serial_sendSCID(&SerialD, SendAStarRawData, 36);
	
